MatheusCipolotti/STM32_Codes/STM32F030K6T6/SPI/Expansão_Entradas/Software/PROG/Src/SPI.c
#include "stm32f030x6.h"

#include "defines.h"
#include "delay.h"
#include "SPI.h"

void SPI1_Init(void){
	// 1. Habilita clock para GPIOA e SPI1
	RCC->AHBENR  |= RCC_AHBENR_GPIOAEN;
	RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;

	// 2. Configura PA5 (SCK), PA6 (MISO), PA7 (MOSI) como Alternate Function
	GPIOA->MODER &= ~(GPIO_MODER_MODER5_Msk | GPIO_MODER_MODER6_Msk | GPIO_MODER_MODER7_Msk);
	GPIOA->MODER |=  (GPIO_MODER_MODER5_1 | GPIO_MODER_MODER6_1 | GPIO_MODER_MODER7_1);  // AF mode

	// AF0 para SPI1 (PA5, PA6, PA7)
	GPIOA->AFR[0] &= ~((0xF << (5 * 4)) | (0xF << (6 * 4)) | (0xF << (7 * 4)));

	SPI1->CR1 &= ~SPI_CR1_SPE;

	// 3. Configura SPI1 como mestre, software NSS, prescaler baixo
	SPI1->CR1 = 0;
	SPI1->CR1 |= SPI_CR1_MSTR;      										// Modo mestre
	SPI1->CR1 |= SPI_CR1_SSM;       										// Software slave management
	SPI1->CR1 |= SPI_CR1_SSI;       										// NSS em high
	SPI1->CR1 |= SPI_CR1_BR_0 | SPI_CR1_BR_1 | SPI_CR1_BR_2;
	//SPI1->CR1 &= ~(SPI_CR1_CPOL | SPI_CR1_CPHA); 							// CPOL=0, CPHA=0

	SPI1->CR2 = 0;
	SPI1->CR2 |= (7 << SPI_CR2_DS_Pos);  									// DS = 7 => 8 bits
	SPI1->CR2 |= SPI_CR2_FRXTH;          									// RXNE = 1 quando FIFO >= 1 byte
	SPI1->CR2 |= SPI_CR2_SSOE;           									// Ativa NSS como saída (opcional)

	SPI1->CR1 |= SPI_CR1_SPE;       										// Habilita SPI
}

void SPI1_Write(uint8_t data){
	while (!(SPI1->SR & SPI_SR_TXE));
	*((__IO uint8_t*)&SPI1->DR) = data;  									//acesso forçado de 8 bits, sem isso o compilador força um sinal de 16 bits
	while (!(SPI1->SR & SPI_SR_TXE));
	while (SPI1->SR & SPI_SR_BSY);
}

uint8_t SPI1_Read(void){
    // Lê 8 bits via SPI
    while (!(SPI1->SR & SPI_SR_TXE)); 										// Espera buffer TX livre
    *(uint8_t*)&SPI1->DR = 0xFF;					                 					// Gera clock

    //*((__IO uint8_t*)&SPI1->DR) = 0xFF;
    while (!(SPI1->SR & SPI_SR_RXNE)); 										// Espera dado disponível
    return SPI1->DR;
}
